import React, { useState } from 'react';
import styles from './Delivery.module.scss';

const Delivery = () => {
  return ( 
  <div className={styles.container}>
    <div className={styles.containerDeliveryKosss}>
      <div className={styles.titleDeliveryKosss}>
        <h1>Доставка та оплата</h1>
        <p>Головна / <span style={{ color: '#9EA2AA' }}>Доставка та оплата</span></p>
      </div>
      <div className={styles.contantDeliveryKosss}>
        <div className={styles.delivDeliveryKosss}>
          <h2>Доставка</h2>
          <p>Ми цінуємо кожного гостя нашего ресторану, саме тому надаємо послугу доставкі страв і напоїв. Ми розуміємо, що не у всіх є час, щоб відвідати наш затишний ресторан, а також бувають ситуації, коли ви хочете повечеряти в домашній сімейній обстановці або замовити їжу для свята. Саме в цих випадках у вас є можливість замовити страви і наша власна служба доставки або сервіс ubereats привезе ваше замовлення за вказаною адресою в межах Київа.</p>
          <p>Ми прагнемо якомога швидше обробити і доставити кожне замовлення, але слід врахувати час приготування, так як всі страви видаються з-під ножа. <br /> Середній час приготування (залежить від позиції та кількості) займає близько 30 хвилин. Додатково враховується адреса одержувача, кількість гостей в ресторані, ситуація на дорогах міста.Радимо робити замовлення заздалегідь.</p>
          <p>Доставка по Києву здійснюється: щодня з 12:00 до 22:00, діапозон часу: від 1 до 1.5 годин</p>
          <p></p>
        </div>
        <div className={styles.paymantDeliveryKosss}>
          <h2>Оплата</h2>
          <p>оплата за заказ здійснюється налічними або Картою кур'єру. після оплати ви отрумуєте від кур'єра фіксальний чек</p>
          <p>Всі скідки та бонуси дійсні тількі якщо використани під час оформлення заказу </p>
          <p>оплата на сайті наразі відсутня </p>
        </div>
      </div>
    </div>
  </div>
    );
  };


export default Delivery;